---
kind: type
id: T:Autodesk.Revit.DB.HostedSweep
source: html/e0744068-e808-4547-3743-81be0a4adcbc.htm
---
# Autodesk.Revit.DB.HostedSweep

An object that represents an object hosted by an edge of a roof or floor within the Autodesk Revit project.

## Syntax (C#)
```csharp
public abstract class HostedSweep : HostObject
```